[
    {
     "Class":"Barbarian",
     "hitDie":"d12",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Rage",
       "level":1,
       "value":[2,2,3,3,3,4,4,4,4,4,4,5,5,5,5,5,6,6,6,6],
       "reset":"long",
       "display":"bubble",
       "classLevel":"BarbarianLevel",
       "desc":"On your turn, you can enter a rage as a bonus action.\n\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\n\n- You have advantage on Strength checks and Strength saving throws.\n- When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.\n- You have resistance to bludgeoning, piercing, and slashing damage.\n\nIf you are able to cast spells, you can't cast them or concentrate on them while raging.\n\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n\nOnce you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
      }
     ]
    },
    {
     "Class":"Barbarian",
     "subclass":"Berserker",
     "counters":[]
    },
    {
     "Class":"Barbarian",
     "subclass":"Totem Warrior",
     "counters":[]
    },
    {
     "Class":"Bard",
     "hitDie":"d8",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Bardic Inspiration",
       "level":1,
       "value":"charismaMod",
       "reset":"long$5$short",
       "display":"bubble",
       "classLevel":"BardLevel",
       "desc":"You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\n\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
      }
     ]
    },
    {
     "Class":"Bard",
     "subclass":"Lore",
     "counters":[]
    },
    {
     "Class":"Bard",
     "subclass":"Valor",
     "counters":[]
    },
    {
     "Class":"Cleric",
     "hitDie":"d8",
     "subclassLevel":1,
     "counters":[
      {
       "name":"Channel Divinity",
       "level":2,
       "value":[1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,3,3,3],
       "reset":"short",
       "display":"bubble",
       "noStacking":"True",
       "classLevel":"ClericLevel",
       "desc":"At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses."
      },
      {
       "name":"Divine Intervention",
       "level":10,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"ClericLevel",
       "desc":"Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate.\n\nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required."
      }
     ]
    },
    {
     "Class":"Cleric",
     "subclass":"Knowledge",
     "counters":[
      {
       "name":"Visions of the Past",
       "level":17,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"ClericLevel",
       "desc":"Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n\nUse `!classfeat visions of the past` to view the full description."
      }
     ]
    },
    {
     "Class":"Cleric",
     "subclass":"Life",
     "counters":[]
    },
    {
     "Class":"Cleric",
     "subclass":"Light",
     "counters":[
      {
       "name":"Warding Flare",
       "level":1,
       "value":"wisdomMod",
       "reset":"long",
       "display":"bubble",
       "classLevel":"ClericLevel",
       "desc":"At 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
      }
     ]
    },
    {
     "Class":"Cleric",
     "subclass":"Nature",
     "counters":[]
    },
    {
     "Class":"Cleric",
     "subclass":"Tempest",
     "counters":[
      {
       "name":"Wrath of the Storm",
       "level":1,
       "value":"wisdomMod",
       "reset":"long",
       "display":"bubble",
       "classLevel":"ClericLevel",
       "desc":"At 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
      }
     ]
    },
    {
     "Class":"Cleric",
     "subclass":"Trickery",
     "counters":[]
    },
    {
     "Class":"Cleric",
     "subclass":"War",
     "counters":[
      {
       "name":"War Priest",
       "level":1,
       "value":"wisdomMod",
       "reset":"long",
       "display":"bubble",
       "classLevel":"ClericLevel",
       "desc":"From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
      }
     ]
    },
    {
     "Class":"Druid",
     "hitDie":"d8",
     "subclassLevel":2,
     "counters":[
      {
       "name":"Wild Shape",
       "level":2,
       "value":2,
       "reset":"short",
       "display":"bubble",
       "classLevel":"DruidLevel",
       "desc":"Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table (found in `!classfeat druid: wild shape`. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nUse `!classfeat druid: wild shape` to view the full description."
      }
     ]
    },
    {
     "Class":"Druid",
     "subclass":"Land",
     "counters":[
      {
       "name":"Natural Recovery",
       "level":2,
       "value":[1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10],
       "reset":"long",
       "display":"bubble",
       "classLevel":"DruidLevel",
       "desc":"Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest.\n\nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots."
      }
     ]
    },
    {
     "Class":"Druid",
     "subclass":"Moon",
     "counters":[]
    },
    {
     "Class":"Fighter",
     "hitDie":"d10",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Second Wind",
       "level":1,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"FighterLevel",
       "desc":"You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
      },
      {
       "name":"Action Surge",
       "level":2,
       "value":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2],
       "reset":"short",
       "display":"bubble",
       "classLevel":"FighterLevel",
       "desc":"Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
      },
      {
       "name":"Indomitable",
       "level":9,
       "value":[0,0,0,0,0,0,0,0,1,1,1,1,2,2,2,2,3,3,3,3],
       "reset":"long",
       "display":"bubble",
       "classLevel":"FighterLevel",
       "desc":"Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.\n\nYou can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
      }
     ]
    },
    {
     "Class":"Fighter",
     "subclass":"Battle Master",
     "counters":[
      {
       "name":"Superiority Dice",
       "level":3,
       "value":[0,0,4,4,4,4,5,5,5,5,5,5,5,5,6,6,6,6,6,6],
       "reset":"short",
       "display":"bubble",
       "classLevel":"FighterLevel",
       "desc":"You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n\nYou gain another superiority die at 7th level and one more at 15th level."
      }
     ]
    },
    {
     "Class":"Fighter",
     "subclass":"Champion",
     "counters":[]
    },
    {
     "Class":"Fighter",
     "subclass":"Eldritch Knight",
     "counters":[]
    },
    {
     "Class":"Monk",
     "hitDie":"d8",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Ki Points",
       "level":2,
       "value":"MonkLevel",
       "reset":"short",
       "display":"default",
       "classLevel":"MonkLevel",
       "desc":"Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: **Flurry of Blows**, **Patient Defense**, and **Step of the Wind**. You learn more ki features as you gain levels in this class.\n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nUse `!classfeat monk: ki` to view the full description."
      }
     ]
    },
    {
     "Class":"Monk",
     "subclass":"Four Elements",
     "counters":[]
    },
    {
     "Class":"Monk",
     "subclass":"Open Hand",
     "counters":[
      {
       "name":"Wholeness of Body",
       "level":6,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"MonkLevel",
       "desc":"At 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again."
      }
     ]
    },
    {
     "Class":"Monk",
     "subclass":"Shadow",
     "counters":[]
    },
    {
     "Class":"Paladin",
     "hitDie":"d10",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Lay on Hands",
       "level":1,
       "value":0,
       "reset":"long",
       "display":"default",
       "classLevel":"PaladinLevel",
       "deprecated":1},
      {
       "name":"Lay on Hands Pool",
       "level":1,
       "value":"PaladinLevel",
       "multiplier":5,
       "reset":"long",
       "display":"default",
       "classLevel":"PaladinLevel",
       "desc":"Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.\n\nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.\n\nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n\nThis feature has no effect on undead and constructs."
      },
      {
       "name":"Divine Sense",
       "level":1,
       "value":"charismaMod",
       "modifier":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell.\n\nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
      },
      {
       "name":"Channel Divinity",
       "level":3,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "noStacking":"True",
       "classLevel":"PaladinLevel",
       "desc":"A paladin of 3rd level or higher gains two Channel Divinity options. Use `!classfeat <your oath here>: channel divinity` to view the description of your options."
      },
      {
       "name":"Cleansing Touch",
       "level":14,
       "value":"charismaMod",
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
      }
     ]
    },
    {
     "Class":"Paladin",
     "subclass":"Ancients",
     "counters":[
      {
       "name":"Undying Sentinel",
       "level":15,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"Starting at 15th level, when you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can't use it again until you finish a long rest.\n\nAdditionally, you suffer none of the drawbacks of old age, and you can't be aged magically."
      },
      {
       "name":"Elder Champion",
       "level":20,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"At 20th level, you can assume the form of an ancient force of nature, taking on an appearance you choose. For example, your skin might turn green or take on a bark-like texture, your hair might become leafy or moss-like, or you might sprout antlers or a lion-like mane.\n\nUsing your action, you undergo a transformation. For 1 minute, you gain the following benefits:\n\n- At the start of each of your turns, you regain 10 hit points.\n- Whenever you cast a paladin spell that has a casting time of 1 action, you can cast it using a bonus action instead.\n- Enemy creatures within 10 feet of you have disadvantage on saving throws against your paladin spells and Channel Divinity options.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Paladin",
     "subclass":"Devotion",
     "counters":[
      {
       "name":"Holy Nimbus",
       "level":20,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\n\nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.\n\nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Paladin",
     "subclass":"Vengeance",
     "counters":[
      {
       "name":"Avenging Angel",
       "level":20,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"PaladinLevel",
       "desc":"At 20th level, you can assume the form of an angelic avenger. Using your action, you undergo a transformation. For 1 hour, you gain the following benefits:\n\n- Wings sprout from your back and grant you a flying speed of 60 feet.\n- You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeed on a Wisdom saving throw or become frightened of you for 1 minute or until it takes any damage. Attack rolls against the frightened creature have advantage.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Ranger",
     "hitDie":"d10",
     "subclassLevel":3,
     "counters":[]
    },
    {
     "Class":"Ranger",
     "subclass":"Beast Master",
     "counters":[]
    },
    {
     "Class":"Ranger",
     "subclass":"Hunter",
     "counters":[]
    },
    {
     "Class":"Rogue",
     "hitDie":"d8",
     "subclassLevel":3,
     "counters":[
      {
       "name":"Stroke of Luck",
       "level":20,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"RogueLevel",
       "desc":"At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      }
     ]
    },
    {
     "Class":"Rogue",
     "subclass":"Arcane Trickster",
     "counters":[
      {
       "name":"Spell Thief",
       "level":17,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"RogueLevel",
       "desc":"At 17th level, you gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.\n\nImmediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your reaction to force the creature to make a saving throw with its spellcasting ability modifier. The DC equals your spell save DC. On a failed save, you negate the spell's effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast (it doesn't need to be a wizard spell). For the next 8 hours, you know the spell and can cast it using your spell slots. The creature can't cast that spell until the 8 hours have passed.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Rogue",
     "subclass":"Assassin",
     "counters":[]
    },
    {
     "Class":"Rogue",
     "subclass":"Thief",
     "counters":[]
    },
    {
     "Class":"Sorcerer",
     "hitDie":"d6",
     "subclassLevel":1,
     "counters":[
      {
       "name":"Sorcery Points",
       "level":2,
       "value":"SorcererLevel",
       "reset":"long",
       "display":"default",
       "classLevel":"SorcererLevel",
       "desc":"At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. You start with 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest."
      }
     ]
    },
    {
     "Class":"Sorcerer",
     "subclass":"Draconic Bloodline",
     "counters":[]
    },
    {
     "Class":"Sorcerer",
     "subclass":"Wild Magic",
     "counters":[
      {
       "name":"Tides of Chaos",
       "level":1,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"SorcererLevel",
       "desc":"Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again.\n\nAny time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature."
      }
     ]
    },
    {
     "Class":"Warlock",
     "hitDie":"d8",
     "subclassLevel":1,
     "counters":[
      {
       "name":"Eldritch Master",
       "level":20,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
      }
     ]
    },
    {
     "Class":"Warlock",
     "subclass":"Archfey",
     "counters":[
      {
       "name":"Fey Presence",
       "level":1,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"Starting at 1st level, your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. The creatures that fail their saving throws are all charmed or frightened by you (your choice) until the end of your next turn.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      },
      {
       "name":"Misty Escape",
       "level":6,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"Starting at 6th level, you can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the start of your next turn or until you attack or cast a spell.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      },
      {
       "name":"Dark Delirium",
       "level":14,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"Starting at 14th level, you can plunge a creature into an illusory realm. As an action, choose a creature that you can see within 60 feet of you. It must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until your concentration is broken (as if you are concentrating on a spell). This effect ends early if the creature takes any damage.\n\nUntil this illusion ends, the creature thinks it is lost in a misty realm, the appearance of which you choose. The creature can see and hear only itself, you, and the illusion.\n\nYou must finish a short or long rest before you can use this feature again."
      }
     ]
    },
    {
     "Class":"Warlock",
     "subclass":"Fiend",
     "counters":[
      {
       "name":"Dark One's Own Luck",
       "level":6,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      },
      {
       "name":"Hurl Through Hell",
       "level":14,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\n\nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Warlock",
     "subclass":"Great Old One",
     "counters":[
      {
       "name":"Entropic Ward",
       "level":6,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WarlockLevel",
       "desc":"At 6th level, you learn to magically ward yourself against attack and to turn an enemy's failed strike into good luck for yourself. When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      }
     ]
    },
    {
     "Class":"Wizard",
     "hitDie":"d6",
     "subclassLevel":2,
     "counters":[
      {
       "name":"Arcane Recovery",
       "level":1,
       "value":[1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10],
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
      },
      {
       "name":"Signature Spells",
       "level":20,
       "value":2,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest.\n\nIf you want to cast either spell at a higher level, you must expend a spell slot as normal."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Abjuration",
     "counters":[
      {
       "name":"Arcane Ward",
       "level":2,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 2nd level, you can weave magic around yourself for protection. When you cast an abjuration spell of 1st level or higher, you can simultaneously use a strand of the spell's magic to create a magical ward on yourself that lasts until you finish a long rest. The ward has a hit point maximum equal to twice your wizard level + your Intelligence modifier. Whenever you take damage, the ward takes the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage.\n\nWhile the ward has 0 hit points, it can't absorb damage, but its magic remains. Whenever you cast an abjuration spell of 1st level or higher, the ward regains a number of hit points equal to twice the level of the spell.\n\nOnce you create the ward, you can't create it again until you finish a long rest."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Conjuration",
     "counters":[
      {
       "name":"Benign Transposition",
       "level":6,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 6th level, you can use your action to teleport up to 30 feet to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places.\n\nOnce you use this feature, you can't use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Divination",
     "counters":[
      {
       "name":"Portent",
       "level":2,
       "value":[0,2,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3],
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 2nd level when you choose this school, glimpses of the future begin to press in on your awareness. When you finish a long rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.\n\nEach foretelling roll can be used only once. When you finish a long rest, you lose any unused foretelling rolls."
      },
      {
       "name":"The Third Eye",
       "level":10,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 10th level, you can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can't use the feature again until you finish a rest.\n\n**Darkvision.** You gain darkvision out to a range of 60 feet, as described in chapter 8, 'Adventuring.'\n\n**Ethereal Sight.** You can see into the Ethereal Plane within 60 feet of you.\n\n**Greater Comprehension.** You can read any language.\n\n**See Invisibility.** You can see invisible creatures and objects within 10 feet of you that are within line of sight."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Enchantment",
     "counters":[]
    },
    {
     "Class":"Wizard",
     "subclass":"Evocation",
     "counters":[
      {
       "name":"Overchannel",
       "level":14,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell.\n\nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Illusion",
     "counters":[
      {
       "name":"Illusory Self",
       "level":10,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Beginning at 10th level, you can create an illusory duplicate of yourself as an instant, almost instinctual reaction to danger. When a creature makes an attack roll against you, you can use your reaction to interpose the illusory duplicate between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest."
      }
     ]
    },
    {
     "Class":"Wizard",
     "subclass":"Necromancy",
     "counters":[]
    },
    {
     "Class":"Wizard",
     "subclass":"Transmutation",
     "counters":[
      {
       "name":"Shapechanger",
       "level":10,
       "value":1,
       "reset":"short",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"At 10th level, you add the polymorph spell to your spellbook, if it is not there already. You can cast polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower.\n\nOnce you cast polymorph in this way, you can't do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot."
      },
      {
       "name":"Master Transmuter",
       "level":14,
       "value":1,
       "reset":"long",
       "display":"bubble",
       "classLevel":"WizardLevel",
       "desc":"Starting at 14th level, you can use your action to consume the reserve of transmutation magic stored within your transmuter's stone in a single burst. When you do so, choose one of the following effects. Your transmuter's stone is destroyed and can't be remade until you finish a long rest.\n\n**Major Transformation.** You can transmute one nonmagical object--no larger than a 5-foot cube--into another nonmagical object of similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n\n**Panacea.** You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter's stone. The creature also regains all its hit points.\n\n**Restore Life.** You cast the raise dead spell on a creature you touch with the transmuter's stone, without expending a spell slot or needing to have the spell in your spellbook.\n\n**Restore Youth.** You touch the transmuter's stone to a willing creature, and that creature's apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn't extend the creature's lifespan."
      }
     ]
    }
   ]